---
kind: property
id: P:Autodesk.Revit.DB.DividedPath.SpacingRuleLayout
source: html/d65ad61b-b12c-bad1-32ad-782fadc9364d.htm
---
# Autodesk.Revit.DB.DividedPath.SpacingRuleLayout Property

The layout determines how points are distributed along the path.

## Syntax (C#)
```csharp
public SpacingRuleLayout SpacingRuleLayout { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: Invalid layout
 -or-
 When setting this property: A value passed for an enumeration argument is not a member of that enumeration